[
    {
        "m_id": "2",
        "m_title": "The Dark Knight",
        "m_premise": "The plot follows the vigilante Batman, police lieutenant James Gordon, and district attorney Harvey Dent, who form an alliance to dismantle organized crime in Gotham City. Their efforts are derailed by the Joker, an anarchistic mastermind who seeks to test how far Batman will go to save the city from chaos.",
        "m_release": "2008-07-18",
        "m_budget": "185000000",
        "m_boxoffice": "1006000000",
        "m_runtime": "152",
        "m_poster": "818hyvdVfvL._AC_UF894,1000_QL80_.jpg"
    },
    {
        "m_id": "29",
        "m_title": "Furiosa",
        "m_premise": "Snatched from the Green Place of Many Mothers, young Furiosa falls into the hands of a great biker horde led by the warlord Dementus. Sweeping through the Wasteland, they come across the Citadel, presided over by the Immortan Joe. As the two tyrants fight for dominance, Furiosa soon finds herself in a nonstop battle to make her way home.",
        "m_release": "2024-05-24",
        "m_budget": "168000000",
        "m_boxoffice": "32000000",
        "m_runtime": "148",
        "m_poster": "furiosa.jpg"
    },
    {
        "m_id": "27",
        "m_title": "Civil War",
        "m_premise": "In a dystopian future America, a team of military-embedded journalists races against time to reach Washington, D.C., before rebel factions descend upon the White House.",
        "m_release": "2024-04-12",
        "m_budget": "50000000",
        "m_boxoffice": "112000000",
        "m_runtime": "109",
        "m_poster": "civilwar.jpg"
    },
    {
        "m_id": "28",
        "m_title": "The Batman",
        "m_premise": "Batman ventures into Gotham City\\'s underworld when a sadistic killer leaves behind a trail of cryptic clues. As the evidence begins to lead closer to home and the scale of the perpetrator\\'s plans become clear, he must forge new relationships, unmask the culprit and bring justice to the abuse of power and corruption that has long plagued the metropolis.",
        "m_release": "2022-03-04",
        "m_budget": "185000000",
        "m_boxoffice": "772245583",
        "m_runtime": "176",
        "m_poster": "thebatman.jpg"
    },
    {
        "m_id": "20",
        "m_title": "If",
        "m_premise": "After discovering she can see everyone's imaginary friends, a girl embarks on a magical adventure to reconnect forgotten IFs with their kids.",
        "m_release": "2024-05-17",
        "m_budget": "185000000",
        "m_boxoffice": "127000000",
        "m_runtime": "104",
        "m_poster": "ifmovie.jpg"
    },
    {
        "m_id": "21",
        "m_title": "The Fall Guy",
        "m_premise": "A down-and-out stuntman must find the missing star of his ex-girlfriend\\'s blockbuster film.",
        "m_release": "2024-05-03",
        "m_budget": "125000000",
        "m_boxoffice": "130100000",
        "m_runtime": "125",
        "m_poster": "fallguy.jpg"
    },
    {
        "m_id": "30",
        "m_title": "The Strangers: Chapter 1",
        "m_premise": "After their car breaks down in an eerie small town, a young couple is forced to spend the night in a remote cabin. Panic ensues as they are terrorized by three masked strangers who strike with no mercy and seemingly no motive.",
        "m_release": "2024-05-17",
        "m_budget": "8500000",
        "m_boxoffice": "32400000",
        "m_runtime": "91",
        "m_poster": "Chapter-1-Poster.jpeg"
    },
    {
        "m_id": "10",
        "m_title": "Dune part 2",
        "m_premise": "Paul Atreides unites with Chani and the Fremen while seeking revenge against the conspirators who destroyed his family. Facing a choice between the love of his life and the fate of the universe, he must prevent a terrible future only he can foresee.",
        "m_release": "2024-03-01",
        "m_budget": "190000000",
        "m_boxoffice": "711800000",
        "m_runtime": "167",
        "m_poster": "jKE4GGhhSLf4HR2fpD9Ayo2UtAD.jpg"
    },
    {
        "m_id": "7",
        "m_title": "Robocop",
        "m_premise": "RoboCop takes place in Detroit in 2043, in a near-apocalyptic, crime-ridden future. The movie is about a terminally wounded police officer, Alex Murphy, who is murdered by a gang and then revived as a cyborg law enforcer by the megacorporation Omni Consumer Products (OCP). OCP wins a contract from the city government to privatize the police force and uses Murphy's body to test their untested RoboCop prototype. However, RoboCop turns on OCP when he learns of their evil plans.",
        "m_release": "1987-07-17",
        "m_budget": "13700000",
        "m_boxoffice": "53400000",
        "m_runtime": "103",
        "m_poster": "MV5BZWVlYzU2ZjQtZmNkMi00OTc3LTkwZmYtZDVjNmY4OWFmZGJlXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg"
    },
    {
        "m_id": "8",
        "m_title": "Robocop",
        "m_premise": "Set in 2028, a detective becomes critically injured and is turned into a cyborg police officer whose programming blurs the line between man and machine.",
        "m_release": "2014-02-12",
        "m_budget": "130000000",
        "m_boxoffice": "242600000",
        "m_runtime": "108",
        "m_poster": "MV5BMjAyOTUzMTcxN15BMl5BanBnXkFtZTgwMjkyOTc1MDE@._V1_.jpg"
    },
    {
        "m_id": "9",
        "m_title": "Dune",
        "m_premise": "Paul Atreides, a brilliant and gifted young man born into a great destiny beyond his understanding, must travel to the most dangerous planet in the universe to ensure the future of his family and his people.",
        "m_release": "2021-10-21",
        "m_budget": "165000000",
        "m_boxoffice": "407500000",
        "m_runtime": "155",
        "m_poster": "61QbqeCVm0L.jpg"
    },
    {
        "m_id": "31",
        "m_title": "Tarot",
        "m_premise": "The story follows a group of college students who, after using a strange Tarot deck, begin to gruesomely die one by one and must uncover the deck\\'s mystery before time runs out.",
        "m_release": "2024-05-03",
        "m_budget": "8000000",
        "m_boxoffice": "45300000",
        "m_runtime": "92",
        "m_poster": "tarot.jpg"
    },
    {
        "m_id": "32",
        "m_title": "The First Omen",
        "m_premise": "A woman starts to question her own faith when she uncovers a terrifying conspiracy to bring about the birth of evil incarnate in Rome.",
        "m_release": "2024-04-05",
        "m_budget": "30000000",
        "m_boxoffice": "53700000",
        "m_runtime": "117",
        "m_poster": "thefirstomen.jpeg"
    },
    {
        "m_id": "33",
        "m_title": "Near Dark",
        "m_premise": "A small-town farmer\\'s son reluctantly joins a traveling group of vampires after he is bitten by a beautiful drifter.",
        "m_release": "1987-10-02",
        "m_budget": "5000000",
        "m_boxoffice": "3400000",
        "m_runtime": "94",
        "m_poster": "neardark.jpg"
    },
    {
        "m_id": "34",
        "m_title": "X-Men",
        "m_premise": "They are children of the atom, homo superior, the next link in the chain of evolution. Each was born with a unique genetic mutation, which at puberty manifested itself in extraordinary powers. In a world filled with hate and prejudice, they are feared by those who cannot accept their differences. Led by Xavier the X-Men fight to protect a world that fears them. They are locked in a battle with former colleague and friend, Magneto who believes humans and mutants should never co-exist.",
        "m_release": "2000-07-14",
        "m_budget": "75000000",
        "m_boxoffice": "293300000",
        "m_runtime": "104",
        "m_poster": "x-men.jpg"
    },
    {
        "m_id": "35",
        "m_title": "X-Men 2",
        "m_premise": "Stryker (Brian Cox), a villianous former Army commander, holds the key to Wolverine\\'s (Hugh Jackman) past and the future of the X-Men. This threat re-ignites the call for a mutant registration act. Stryker starts a full-out assault on Professor Xavier\\'s (Patrick Stewart) mansion and school. After escaping his plastic cell, Magneto (Ian McKellen) proposes a partnership with Xavier and the X-Men to combat this new formidable enemy they both have in common.",
        "m_release": "2003-05-02",
        "m_budget": "110000000",
        "m_boxoffice": "407700000",
        "m_runtime": "133",
        "m_poster": "X2_poster.jpg"
    },
    {
        "m_id": "36",
        "m_title": "X-Men: The Last Stand",
        "m_premise": "The discovery of a cure for mutations leads to a turning point for Mutants (Hugh Jackman, Halle Berry, Famke Janssen, Anna Paquin, Rebecca Romijn, Kelsey Grammer). They may now choose to give up their powers and become fully human or retain their uniqueness and remain isolated. War looms between the followers of Charles Xavier (Patrick Stewart), who preaches tolerance, and those of Magneto (Ian McKellen), who advocates survival of the fittest.",
        "m_release": "2006-05-26",
        "m_budget": "210000000",
        "m_boxoffice": "460400000",
        "m_runtime": "104",
        "m_poster": "xmenlaststand.jpg"
    },
    {
        "m_id": "37",
        "m_title": "X-Men Origins: Wolverine",
        "m_premise": "Seeking solace from his dark past, Logan (Hugh Jackman), better known as Wolverine, seems to have found love and contentment with Kayla Silverfox (Lynn Collins). Logan\\'s peaceful existence is shattered when Victor Creed (Liev Schreiber), his vicious brother, brutally murders Kayla. Logan\\'s thirst for revenge propels him into the Weapon X program, where he undergoes a painful procedure to bond his bones with adamantium, making him virtually indestructible and more than a match for Victor.",
        "m_release": "2009-05-01",
        "m_budget": "150000000",
        "m_boxoffice": "373100000",
        "m_runtime": "107",
        "m_poster": "MV5BYmY4MjJhMzMtZDlkNy00MzhiLTkyMjEtYjA3ZTZhMjU4YTRhXkEyXkFqcGdeQXVyMTA0MTM5NjI2._V1_.jpg"
    },
    {
        "m_id": "38",
        "m_title": "X-Men: First Class",
        "m_premise": "In the early 1960s, during the height of the Cold War, a mutant named Charles Xavier (James McAvoy) meets a fellow mutant named Erik Lehnsherr (Michael Fassbender). Despite their vastly different backgrounds -- Charles grew up with a wealthy family, while Erik lost his parents at Auschwitz -- the two become close friends. As the world teeters on the brink of a nuclear war, Charles and Erik with other mutants join forces to save humanity. However, a situation soon tears the friends apart.",
        "m_release": "2011-05-25",
        "m_budget": "160000000",
        "m_boxoffice": "353600000",
        "m_runtime": "132",
        "m_poster": "MV5BMTg5OTMxNzk4Nl5BMl5BanBnXkFtZTcwOTk1MjAwNQ@@._V1_.jpg"
    }
]