[
    {
        "m_id": "2",
        "m_title": "The Dark Knight",
        "m_premise": "The plot follows the vigilante Batman, police lieutenant James Gordon, and district attorney Harvey Dent, who form an alliance to dismantle organized crime in Gotham City. Their efforts are derailed by the Joker, an anarchistic mastermind who seeks to test how far Batman will go to save the city from chaos.",
        "m_release": "2008-07-18",
        "m_budget": "185000000",
        "m_boxoffice": "1006000000",
        "m_runtime": "152",
        "m_poster": "818hyvdVfvL._AC_UF894,1000_QL80_.jpg"
    },
    {
        "m_id": "29",
        "m_title": "Furiosa",
        "m_premise": "Snatched from the Green Place of Many Mothers, young Furiosa falls into the hands of a great biker horde led by the warlord Dementus. Sweeping through the Wasteland, they come across the Citadel, presided over by the Immortan Joe. As the two tyrants fight for dominance, Furiosa soon finds herself in a nonstop battle to make her way home.",
        "m_release": "2024-05-24",
        "m_budget": "168000000",
        "m_boxoffice": "32000000",
        "m_runtime": "148",
        "m_poster": "furiosa.jpg"
    },
    {
        "m_id": "27",
        "m_title": "Civil War",
        "m_premise": "In a dystopian future America, a team of military-embedded journalists races against time to reach Washington, D.C., before rebel factions descend upon the White House.",
        "m_release": "2024-04-12",
        "m_budget": "50000000",
        "m_boxoffice": "112000000",
        "m_runtime": "109",
        "m_poster": "civilwar.jpg"
    },
    {
        "m_id": "28",
        "m_title": "The Batman",
        "m_premise": "Batman ventures into Gotham City\\'s underworld when a sadistic killer leaves behind a trail of cryptic clues. As the evidence begins to lead closer to home and the scale of the perpetrator\\'s plans become clear, he must forge new relationships, unmask the culprit and bring justice to the abuse of power and corruption that has long plagued the metropolis.",
        "m_release": "2022-03-04",
        "m_budget": "185000000",
        "m_boxoffice": "772245583",
        "m_runtime": "176",
        "m_poster": "thebatman.jpg"
    },
    {
        "m_id": "20",
        "m_title": "If",
        "m_premise": "After discovering she can see everyone's imaginary friends, a girl embarks on a magical adventure to reconnect forgotten IFs with their kids.",
        "m_release": "2024-05-17",
        "m_budget": "185000000",
        "m_boxoffice": "127000000",
        "m_runtime": "104",
        "m_poster": "ifmovie.jpg"
    },
    {
        "m_id": "21",
        "m_title": "The Fall Guy",
        "m_premise": "A down-and-out stuntman must find the missing star of his ex-girlfriend\\'s blockbuster film.",
        "m_release": "2024-05-03",
        "m_budget": "125000000",
        "m_boxoffice": "130100000",
        "m_runtime": "125",
        "m_poster": "fallguy.jpg"
    },
    {
        "m_id": "10",
        "m_title": "Dune part 2",
        "m_premise": "Paul Atreides unites with Chani and the Fremen while seeking revenge against the conspirators who destroyed his family. Facing a choice between the love of his life and the fate of the universe, he must prevent a terrible future only he can foresee.",
        "m_release": "2024-03-01",
        "m_budget": "190000000",
        "m_boxoffice": "711800000",
        "m_runtime": "167",
        "m_poster": "jKE4GGhhSLf4HR2fpD9Ayo2UtAD.jpg"
    },
    {
        "m_id": "7",
        "m_title": "Robocop",
        "m_premise": "RoboCop takes place in Detroit in 2043, in a near-apocalyptic, crime-ridden future. The movie is about a terminally wounded police officer, Alex Murphy, who is murdered by a gang and then revived as a cyborg law enforcer by the megacorporation Omni Consumer Products (OCP). OCP wins a contract from the city government to privatize the police force and uses Murphy's body to test their untested RoboCop prototype. However, RoboCop turns on OCP when he learns of their evil plans.",
        "m_release": "1987-07-17",
        "m_budget": "13700000",
        "m_boxoffice": "53400000",
        "m_runtime": "103",
        "m_poster": "MV5BZWVlYzU2ZjQtZmNkMi00OTc3LTkwZmYtZDVjNmY4OWFmZGJlXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg"
    },
    {
        "m_id": "8",
        "m_title": "Robocop",
        "m_premise": "Set in 2028, a detective becomes critically injured and is turned into a cyborg police officer whose programming blurs the line between man and machine.",
        "m_release": "2014-02-12",
        "m_budget": "130000000",
        "m_boxoffice": "242600000",
        "m_runtime": "108",
        "m_poster": "MV5BMjAyOTUzMTcxN15BMl5BanBnXkFtZTgwMjkyOTc1MDE@._V1_.jpg"
    },
    {
        "m_id": "9",
        "m_title": "Dune",
        "m_premise": "Paul Atreides, a brilliant and gifted young man born into a great destiny beyond his understanding, must travel to the most dangerous planet in the universe to ensure the future of his family and his people.",
        "m_release": "2021-10-21",
        "m_budget": "165000000",
        "m_boxoffice": "407500000",
        "m_runtime": "155",
        "m_poster": "61QbqeCVm0L.jpg"
    }
]